[
  {
    "title": "Persuasive or Deceptive Visualization",
    "year": "2025",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Visualization of the proposition: Black and Hispanic officers face disproportionately higher substantiation rates when complaints are filed against them."
  },
  {
    "title": "Visualization Critique & Redesign",
    "year": "2025",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Redesigning a visualization of the COVID-19 pandemic."
  },
  {
    "title": "Exploratory Data Analysis",
    "year": "2025",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Exploring Transportation Oriented Development in the Boston Area"
  },
  {
    "title": "Distributed Cloud Storage System",
    "year": "2023",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Built a distributed file storage system that splits and encrypts files across multiple cloud providers. Implemented erasure coding techniques to ensure data integrity even if two storage nodes fail simultaneously, with automatic recovery mechanisms."
  },
  {
    "title": "Augmented Reality Navigation App",
    "year": "2023",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Created a mobile AR application that overlays navigation instructions on the real world using computer vision algorithms. The app recognizes landmarks to provide context-aware directions and works even in areas with poor GPS signal."
  },
  {
    "title": "Algorithmic Trading Platform",
    "year": "2022",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Designed and implemented a backtesting platform for algorithmic trading strategies. The system processes historical market data and evaluates multiple strategies simultaneously, generating comprehensive performance metrics and visualizations."
  },
  {
    "title": "Computer Vision for Medical Imaging",
    "year": "2021",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Developed a deep learning system that identifies potential abnormalities in X-ray images. The model achieves 88% sensitivity and 92% specificity, helping radiologists prioritize urgent cases and improve diagnostic accuracy."
  },
  {
    "title": "Smart Home Energy Optimizer",
    "year": "2021",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Created an IoT system that monitors and optimizes energy usage in homes. The platform uses machine learning to predict consumption patterns and automatically adjusts smart appliances to reduce electricity costs while maintaining comfort."
  },
  {
    "title": "Secure Voting Blockchain Application",
    "year": "2020",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Implemented a blockchain-based voting system that ensures vote integrity and anonymity. The application includes identity verification methods while maintaining vote secrecy, and provides transparent audit trails without compromising voter privacy."
  },
  {
    "title": "Quantum Algorithm Simulator",
    "year": "2020",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Developed a simulation platform for testing quantum computing algorithms without requiring quantum hardware. The simulator can model up to 25 qubits and implements common quantum gates, allowing researchers to experiment with quantum algorithms on classical computers."
  },
  {
    "title": "Sustainable Urban Mobility Planner",
    "year": "2019",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Created an application that optimizes urban commuting by suggesting routes that minimize carbon footprint. Integrates public transit data, bike-sharing availability, and walking paths to recommend eco-friendly travel options customized to user preferences and constraints."
  },
  {
    "title": "Accessible Web Framework",
    "year": "2019",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "description": "Designed and built a front-end framework focused on accessibility from the ground up. Features include automatic ARIA attribute management, keyboard navigation patterns, and built-in screen reader testing tools. Meets WCAG 2.1 AAA compliance standards by default."
  }
]
